# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install Binaries
brew 'bash'
brew 'coreutils'
brew 'findutils'
brew 'grep'
brew 'git'
brew 'node'
brew 'watchman'
brew 'wget'
brew 'pure'
brew 'mas'
brew 'mackup'
brew 'nvm'
brew 'svn'

# Development
brew 'php'
brew 'mysql'
brew 'imagemagick'

brew 'python'
brew 'pipenv'
brew 'flake8'
brew 'yapf'

# Apps
cask 'firefox'
cask 'figma'
cask 'herd'
cask 'httpie'
cask 'hyper'
cask 'microsoft-edge'
cask 'notion'
cask 'screen-studio'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'tuple'
cask 'raycast'
cask 'visual-studio-code'

# Fonts
cask 'font-cascadia-code'
cask 'font-fira-code'

# Install Mac App Store apps
mas 'Spark', id: 1176895641
