alexdima.copy-relative-path
amiralizadeh9480.laravel-extra-intellisense
bierner.markdown-preview-github-styles
bmewburn.vscode-intelephense-client
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
codingyu.laravel-goto-view
dbaeumer.vscode-eslint
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
github.github-vscode-theme
glitchbl.laravel-create-view
ihunte.laravel-blade-wrapper
mikestead.dotenv
ms-vscode.vscode-typescript-next
naoray.laravel-goto-components
onecentlin.laravel-blade
onecentlin.laravel-extension-pack
onecentlin.laravel5-snippets
open-southeners.laravel-pint
patbenatar.advanced-new-file
pgl.laravel-jump-controller
prisma.prisma
ryannaddy.laravel-artisan
shufo.vscode-blade-formatter
tombonnike.vscode-status-bar-format-toggle
unifiedjs.vscode-mdx