alefragnani.Bookmarks
alexdima.copy-relative-path
bmewburn.vscode-intelephense-client
calebporzio.better-phpunit
christian-kohler.npm-intellisense
CoenraadS.bracket-pair-colorizer
EditorConfig.EditorConfig
esbenp.prettier-vscode
flowtype.flow-for-vscode
formulahendry.auto-close-tag
junstyle.php-cs-fixer
ms-python.python
neilbrayfield.php-docblocker
nikitaKunevich.snippet-creator
octref.vetur
onecentlin.laravel-blade
patbenatar.advanced-new-file
ricard.postcss
sdras.night-owl
sdras.vue-vscode-extensionpack
sdras.vue-vscode-snippets
silvenon.mdx
thomaspink.theme-github
tombonnike.vscode-status-bar-format-toggle
vncz.vscode-apielements
whatwedo.twig
whizkydee.material-palenight-theme
wmaurer.vscode-jumpy
xabikos.JavaScriptSnippets
Zignd.html-css-class-completion